In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\vinayak\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\users\vinayak\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\vinayak\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\vinayak\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\vinayak\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

data={
    "name":["Raj","ron","akesh","ric","rix"],
    "score_math":[10,20,30,40,50],
    "score_science":[20,10,40,50,60]
}

In [3]:
print(data)

{'name': ['Raj', 'ron', 'akesh', 'ric', 'rix'], 'score_math': [10, 20, 30, 40, 50], 'score_science': [20, 10, 40, 50, 60]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

    name  score_math  score_science
0    Raj          10             20
1    ron          20             10
2  akesh          30             40
3    ric          40             50
4    rix          50             60

In [6]:
df.columns

Index(['name', 'score_math', 'score_science'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           5 non-null      object
 1   score_math     5 non-null      int64
 2   score_science  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [8]:
df.describe()

       score_math  score_science
count    5.000000       5.000000
mean    30.000000      36.000000
std     15.811388      20.736441
min     10.000000      10.000000
25%     20.000000      20.000000
50%     30.000000      40.000000
75%     40.000000      50.000000
max     50.000000      60.000000